Sammlung Inhalte/Tests_BA/cmrq010_siege_terminal.txt
** SIEGE 4.1.7
** Preparing 50 concurrent users for battle.
The server is now under siege...
HTTP/1.1 200     0.23 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.36 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.44 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.69 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.86 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.34 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.55 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.58 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.75 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.91 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.72 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     2.75 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     4.79 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     5.85 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     4.84 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     4.83 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.64 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.62 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.64 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     7.86 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     4.83 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     4.84 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     4.83 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     4.83 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200    11.91 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.64 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.63 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.64 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200    11.94 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     7.88 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.72 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.69 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.64 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     5.85 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     4.83 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     4.84 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     5.86 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     7.88 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200    12.06 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     5.86 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.70 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200    11.94 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.70 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.69 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200    12.00 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     1.70 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     1.69 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
[...]
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.66 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200    20.27 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200    20.25 secs:      49 bytes ==> GET  /deviceinfo/getdata
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[...]
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[...]
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out
[...]
[alert] socket: select and discovered it's not ready sock.c:384: Connection timed out
[alert] socket: read check timed out(30) sock.c:273: Connection timed out

Lifting the server siege...
Transactions:		      361    hits
Availability:		       81.49 %
Elapsed time:		       60.90 secs
Data transferred:	        0.02 MB
Response time:		     1251.22 ms
Transaction rate:	        5.93 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        7.42
Successful transactions:      361
Failed transactions:	       82
Longest transaction:	    20270.00 ms
Shortest transaction:	      230.00 ms
 
LOG FILE: cmrq010_siege.log
You can disable this log file notification by editing
/home/ifm/.siege/siege.conf and changing 'show-logfile' to false.
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.65 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200    20.09 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.67 secs:      49 bytes ==> GET  /deviceinfo/getdata
HTTP/1.1 200     0.68 secs:      49 bytes ==> GET  /deviceinfo/getdata